app/Dispo.php

    public function relationtable($user,$dateDeb,$dateFin)
    {

      if(empty(Dispo::where('date_debut','=',$dateDeb)->where('date_fin','=',$dateFin)->first())){
---
select * from `dispos` where `date_debut` = '2018-10-05' and `date_fin` = '2018-10-26' limit 1