app/Http/Controllers/UserController.php

select * from `users`
---
    public function index()
    {
        return User::All();